[Killed] ConditionalExpression
src/gilded_rose.js:43:15
       }
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
-          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
+          if (true) {
             if (this.items[i].quality > 0) {
               if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
killedBy: Gilded Rose 'Backstage passes to a TAFKAL80ETC concert', quality drops to 0 after the concert
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 49
