[Killed] UpdateOperator
src/gilded_rose.js:14:44
     this.items = items;
   }
   updateQuality() {
-    for (let i = 0; i < this.items.length; i++) {
+    for (let i = 0; i < this.items.length; i--) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
killedBy: Gilded Rose should foo
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] EqualityOperator
src/gilded_rose.js:14:21
     this.items = items;
   }
   updateQuality() {
-    for (let i = 0; i < this.items.length; i++) {
+    for (let i = 0; i <= this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
killedBy: Gilded Rose should foo
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Survived] BlockStatement
src/gilded_rose.js:15:115
   }
   updateQuality() {
     for (let i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-        if (this.items[i].quality > 0) {
-          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-            this.items[i].quality = this.items[i].quality - 1;
-          }
-        }
-      } else {
+      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {} else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;

[Survived] EqualityOperator
src/gilded_rose.js:15:48
   }
   updateQuality() {
     for (let i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
+      if (this.items[i].name != 'Aged Brie' && this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {

[Survived] ConditionalExpression
src/gilded_rose.js:16:13
   updateQuality() {
     for (let i = 0; i < this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-        if (this.items[i].quality > 0) {
+        if (false) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
             this.items[i].quality = this.items[i].quality - 1;

[NoCoverage] EqualityOperator
src/gilded_rose.js:17:15
     for (let i = 0; i < this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
-          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
+          if (this.items[i].name == 'Sulfuras, Hand of Ragnaros') {
             this.items[i].quality = this.items[i].quality - 1;
           }

[NoCoverage] BlockStatement
src/gilded_rose.js:17:67
     for (let i = 0; i < this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
-          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-            this.items[i].quality = this.items[i].quality - 1;
-          }
+          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {}
         }
       } else {

[NoCoverage] ArithmeticOperator
src/gilded_rose.js:18:37
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-            this.items[i].quality = this.items[i].quality - 1;
+            this.items[i].quality = this.items[i].quality + 1;
           }
         }

[NoCoverage] BlockStatement
src/gilded_rose.js:21:14
             this.items[i].quality = this.items[i].quality - 1;
           }
         }
-      } else {
-        if (this.items[i].quality < 50) {
-          this.items[i].quality = this.items[i].quality + 1;
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-          }
-        }
-      }
+      } else {}
       if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
         this.items[i].sellIn = this.items[i].sellIn - 1;

[NoCoverage] ConditionalExpression
src/gilded_rose.js:24:15
       } else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
+          if (false) {
             if (this.items[i].sellIn < 11) {
               if (this.items[i].quality < 50) {

[NoCoverage] ConditionalExpression
src/gilded_rose.js:24:15
       } else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
+          if (true) {
             if (this.items[i].sellIn < 11) {
               if (this.items[i].quality < 50) {

[NoCoverage] ConditionalExpression
src/gilded_rose.js:25:17
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
           if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].sellIn < 11) {
+            if (false) {
               if (this.items[i].quality < 50) {
                 this.items[i].quality = this.items[i].quality + 1;

[NoCoverage] ConditionalExpression
src/gilded_rose.js:31:19
               }
             }
             if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
+              if (true) {
                 this.items[i].quality = this.items[i].quality + 1;
               }

[Survived] EqualityOperator
src/gilded_rose.js:38:11
           }
         }
       }
-      if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
+      if (this.items[i].name == 'Sulfuras, Hand of Ragnaros') {
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }

[Survived] ConditionalExpression
src/gilded_rose.js:41:11
       if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
-      if (this.items[i].sellIn < 0) {
+      if (false) {
         if (this.items[i].name != 'Aged Brie') {
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {

[Survived] BlockStatement
src/gilded_rose.js:42:48
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
       if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != 'Aged Brie') {
-          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
-              if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-                this.items[i].quality = this.items[i].quality - 1;
-              }
-            }
-          } else {
-            this.items[i].quality = this.items[i].quality - this.items[i].quality;
-          }
-        } else {
+        if (this.items[i].name != 'Aged Brie') {} else {
           if (this.items[i].quality < 50) {
             this.items[i].quality = this.items[i].quality + 1;

[Survived] BlockStatement
src/gilded_rose.js:43:82
       }
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
-          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
-              if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-                this.items[i].quality = this.items[i].quality - 1;
-              }
-            }
-          } else {
+          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {} else {
             this.items[i].quality = this.items[i].quality - this.items[i].quality;
           }

[NoCoverage] BlockStatement
src/gilded_rose.js:44:44
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
-              if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-                this.items[i].quality = this.items[i].quality - 1;
-              }
-            }
+            if (this.items[i].quality > 0) {}
           } else {
             this.items[i].quality = this.items[i].quality - this.items[i].quality;

[Survived] ConditionalExpression
src/gilded_rose.js:44:17
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
+            if (true) {
               if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
                 this.items[i].quality = this.items[i].quality - 1;

[NoCoverage] ConditionalExpression
src/gilded_rose.js:53:15
             this.items[i].quality = this.items[i].quality - this.items[i].quality;
           }
         } else {
-          if (this.items[i].quality < 50) {
+          if (true) {
             this.items[i].quality = this.items[i].quality + 1;
           }

[Killed] ObjectLiteral
src/gilded_rose.js:64:18
   }
 }
 
-module.exports = {
-  Item,
-  Shop
-}
+module.exports = {}
 
killedBy: Gilded Rose should foo
statusReason: TypeError: Item is not a constructor
